{"title": ".NET Framework", "questions": [{"question": "Q1. What is the difference between a stack and queue?\n", "alternatives": [{"alternative": " Queues process value types by a top-down hierarchy - first in, first out (FIFO). Stacks follow this principle and insert items from the lower end while deleting ones from the top - last in, first-out (LIFO).\n", "is_correct": false}, {"alternative": " Queues process value types by a top-down hierarchy-last in, first-out (LIFO). Stacks follow this principle and insert items from the lower end while deleting ones from the top-first in, first-out (FIFO).\n", "is_correct": false}, {"alternative": " Stacks process value types by a top-down hierarchy - last in, first-out (LIFO). Queues follow this principle and insert items from the lower end while deleting ones from the top - first in, first-out (FIFO)\n", "is_correct": true}, {"alternative": " Stacks process value types by a top-down hierarchy-first in, first out (FIFO). Queues follow this principle and insert items from the lower end while deleting ones from the top-last in, first-out (LIFO).\n</ul>\n", "is_correct": false}]}, {"question": "Q2. Which group contains all official types of JIT compilations?\n", "alternatives": [{"alternative": " Pre-JIT, Quick-JIT, Coll-JIT\n", "is_correct": false}, {"alternative": " Before-JIT, Quick-JIT, Cool-JIT\n", "is_correct": false}, {"alternative": " Pre-JIT, Quick-JIT, Normal-JIT\n", "is_correct": false}, {"alternative": " Pre-JIT, Econo-JIT, Normal-JIT\n</ul>\n", "is_correct": true}]}, {"question": "Q3. What is Kestrel?\n", "alternatives": [{"alternative": " an iOS web server initially that was later designed to work with .NET Core\n", "is_correct": false}, {"alternative": " a cross-platform web server ASP.NET Core that is included by default in ASP.NET Core project templates**\n", "is_correct": true}, {"alternative": " a cross-platform, open-source web server that starts up web APIs\n", "is_correct": false}, {"alternative": " a free and open-source cross-platform web server software that can communicate with IIS\n</ul>\n", "is_correct": false}]}, {"question": "Q4. When would you use asynchronous actions?\n", "alternatives": [{"alternative": " to release the quest thread of a I/O operation\n", "is_correct": false}, {"alternative": " to capture the request thread of a I/O operation\n", "is_correct": false}, {"alternative": " to avoid blocking the request thread while waits for an I/O operation\n", "is_correct": true}, {"alternative": " to block the request thread if it waits for an I/O operation\n</ul>\n", "is_correct": false}]}, {"question": "Q5. What is CoreCLR?\n", "alternatives": [{"alternative": " CoreCLR is a component that allows the highest degree of control when coding; you can Abort(), Suspend() or Resume().\n", "is_correct": false}, {"alternative": " CoreCLR is the .NET execution engine that runs the source code. Special programs called compilers must rewrite it into MSIL.\n", "is_correct": false}, {"alternative": " CoreCLR is the .NET execution engine the runs the source code. Special programs called compilers must rewrite it into IL.\n", "is_correct": false}, {"alternative": " CoreCLR is the .NET execution engine in .NET Core that performs functions like garbage collection and compilation to machine code.\n</ul>\n", "is_correct": true}]}, {"question": "Q6. When you define an abstract method, how do you use it in a derived class?\n", "alternatives": [{"alternative": " Abstract methods cannot be used in derived classes.\n", "is_correct": false}, {"alternative": " In your derived class, overload the method.\n", "is_correct": false}, {"alternative": " In your derived class, override the method.\n", "is_correct": true}, {"alternative": " In your derived class, declare the method as virtual.\n</ul>\n", "is_correct": false}]}, {"question": "Q7. Which code do you use if you want to trigger a garbage collection in .NET?\n", "alternatives": [{"alternative": " <code>Garbage.CleanUp();</code>\n", "is_correct": false}, {"alternative": " <code>System.GC.Clear();</code>\n", "is_correct": false}, {"alternative": " <code>System.GC.Collect();</code>\n", "is_correct": true}, {"alternative": " <code>Garbage.Collect();</code>\n</ul>\n", "is_correct": false}]}, {"question": "Q8. You want to include language elements in a program. Which design pattern best fits this objective?\n", "alternatives": [{"alternative": " Interpreter &lt;= correct\n", "is_correct": true}, {"alternative": " Command\n", "is_correct": false}, {"alternative": " Bridge\n", "is_correct": false}, {"alternative": " Decorator\n</ul>\n", "is_correct": false}]}, {"question": "Q9. What makes a strong-named assembly?\n", "alternatives": [{"alternative": " an assembly with the version specified\n", "is_correct": false}, {"alternative": " a signed assembly\n", "is_correct": true}, {"alternative": " an assembly with culture information\n", "is_correct": false}, {"alternative": " an assembly with the name marked as important\n</ul>\n", "is_correct": false}]}, {"question": "Q10. What happens when you concatenate two strings?\n", "alternatives": [{"alternative": " You cannot concatenate strings in .NET.\n", "is_correct": false}, {"alternative": " The second string object is modified so it contains the concatenated strings.\n", "is_correct": false}, {"alternative": " A third string object is created containing the concatenated strings.\n", "is_correct": true}, {"alternative": " The first string object is modified so it contains the concatenated strings.\n</ul>\n", "is_correct": false}]}, {"question": "Q11. What is a delegate?\n", "alternatives": [{"alternative": " A delegate is an object or collection initializer that adds flexibility, readability and maintainability in C#.\n", "is_correct": false}, {"alternative": " A delegate in .NET is similar to a function pointer in C or C++. Using a delegate allows the programmer to encapsulate a reference to a method inside a delegate object.\n", "is_correct": true}, {"alternative": " A delegate is a collection initializer that adds flexibility, readability and maintainability in .NET.\n", "is_correct": false}, {"alternative": " A delegate is an extension method. Using a delegate allows the programmer to add flexibility, readability and maintainability in .NET.\n</ul>\n", "is_correct": false}]}, {"question": "Q12. Which is a set of features that extends the query capabilities of the .NET language syntax by adding sets of new standard query operators that allow data manipulation, regardless of the data source?\n", "alternatives": [{"alternative": " XML\n", "is_correct": false}, {"alternative": " C#\n", "is_correct": false}, {"alternative": " LINQ\n", "is_correct": true}, {"alternative": " XAML\n</ul>\n", "is_correct": false}]}, {"question": "Q13. What is the single responsibility principle?\n", "alternatives": [{"alternative": " Software entities should be open for extension, but closed for modification.\n", "is_correct": false}, {"alternative": " Entities must depend on abstractions, not on concrete implementations.\n", "is_correct": false}, {"alternative": " Objects in a program should be repleaceble with instances of their subtypes without altering the correctness of that programm.\n", "is_correct": false}, {"alternative": " A class should have only a single responsibility - that is, only changes to one part of the software's specification should be able to affect the specification of the class.\n</ul>\n", "is_correct": true}]}, {"question": "Q14. When should a developer use the .NET Standard class library project type?\n", "alternatives": [{"alternative": " when you want to increase the .NET API surface area your library can access, and allow only .NET Core apps to be compatible with your library\n", "is_correct": false}, {"alternative": " when you want to increase the number of apps that are compatible with your library, and decrease the .NET API surface area your library can access\n", "is_correct": true}, {"alternative": " when you want to decrease speed but have more features\n", "is_correct": false}, {"alternative": " when you want to increase compilation speed and have fewer features\n</ul>\n", "is_correct": false}]}, {"question": "Q15. What is the difference between a SDK (software development kit) and runtime in .NET Core?\n", "alternatives": [{"alternative": " The SDK is the \"virtual machine\" that hosts and runs the application and abstracts all the interaction with the operating system; the runtime usually includes documentation and other help files.\n", "is_correct": false}, {"alternative": " The runtime is the virtual machine that hosts and runs the application and abstracts all the interaction with the operating system; the SDK usually includes documentation and other help files.\n", "is_correct": true}, {"alternative": " The runtime compiles code along with the CLR; the SDK usually includes documentation and other help files.\n", "is_correct": false}, {"alternative": " The SDK compiles code along with the CLR; the runtime usually includes documentation and other help files.\n</ul>\n", "is_correct": false}]}, {"question": "Q16. What is the Common Type System (CTS)?\n", "alternatives": [{"alternative": " the component of CLR in which .NET Framework provides support for several languages since it contains a type system that is common with all the languages\n", "is_correct": false}, {"alternative": " the component of CLI in which .NET Framework provides support for several languages since it contains a type system that is common with all the languages\n", "is_correct": true}, {"alternative": " the component of CLR that allows you to map the content of a file to the logical address of an application\n", "is_correct": false}, {"alternative": " the component of CLR that enables you to run multiple versions of an application or component and CLR on the same computer at the same time\n</ul>\n<p><a href=\"https://en.wikipedia.org/wiki/Common_Type_System#:~:text=In%20Microsoft's%20.,languages%20to%20easily%20share%20information.\">reference link</a></p>\n", "is_correct": false}]}, {"question": "Q17. Assuming y is a value type, which is an example of boxing?\n", "alternatives": [{"alternative": " y = (int)thisObject;\n", "is_correct": false}, {"alternative": " int y = 3;\n", "is_correct": false}, {"alternative": " y = (int)thisObject=;3;\n", "is_correct": false}, {"alternative": " object thisObject = y;\n</ul>\n", "is_correct": true}]}, {"question": "Q18. What is an abstract class in .NET?\n", "alternatives": [{"alternative": " An abstract class provides a partial implementation for functionality and some abstract or virtual members that must be implemented by the inheriting entities. It can declare fields too.\n", "is_correct": true}, {"alternative": " An abstract class allows developers to create new classes that reuse, extend, and modify the behavior defined in other classes.\n", "is_correct": false}, {"alternative": " An abstract class is responsible for keeping track of what is actually executing and where each executing thread is.\n", "is_correct": false}, {"alternative": " An abstract class declares a contract or behavior that implementing classes require. It may declare only properties, methods, and events with no access modifiers. All the declared members must be implemented.\n</ul>\n", "is_correct": false}]}, {"question": "Q19. What is the namespace for caching information in .NET?\n", "alternatives": [{"alternative": " System.Data.Caching;\n", "is_correct": false}, {"alternative": " All.System.Caching;\n", "is_correct": false}, {"alternative": " System.Runtime.Caching;\n", "is_correct": true}, {"alternative": " System.Compiler.Caching;\n</ul>\n", "is_correct": false}]}, {"question": "Q20. What is an interface in .NET?\n", "alternatives": [{"alternative": " An interface provides a partial implementation for functionality and some abstract or virtual members that must be implemented by the inheriting entities. It can declare fields too.\n", "is_correct": false}, {"alternative": " An interface is responsible for keeping track of what is actually executing and where each executing thread is.\n", "is_correct": false}, {"alternative": " An interface allows developers to create new classes that reuse, extend, and modify the behavior defined in other classes.\n", "is_correct": false}, {"alternative": " An interface declares a contract or behavior that implementing classes require. It may declare only properties, methods, and events with no access modifiers. All the declared members must be implemented.\n</ul>\n", "is_correct": true}]}, {"question": "Q21. What does CAS stand for and what does it do?\n", "alternatives": [{"alternative": " CAS stands for Code Application Secrets and it enables users to restrict, on a very granular level, what hidden code can do according to a level of trust for an application.\n", "is_correct": false}, {"alternative": " CAS stands for Code Access Secrets and it enables users to restrict, on a very granular level, what hidden code can do according to a level of trust.\n", "is_correct": false}, {"alternative": " CAS stands for Cognitive Access Security and it enables users to restrict security logic manipulation.\n", "is_correct": false}, {"alternative": " CAS stands for Code Access Security and it enables users to restrict, on a very granular level, what managed code can do according to a level of trust.\n</ul>\n", "is_correct": true}]}, {"question": "Q22. Which is NOT true about lambda statements?\n", "alternatives": [{"alternative": " A statement lambda cannot return a value.\n", "is_correct": true}, {"alternative": " If a statement lambda has a return value, it has to use a return statement.\n", "is_correct": false}, {"alternative": " A statement lambda requires using curly braces.\n", "is_correct": false}, {"alternative": " A statement lambda can have more than one statement.\n</ul>\n", "is_correct": false}]}, {"question": "Q23. Which is NOT true about a read-only variable?\n", "alternatives": [{"alternative": " At runtime, its value is evaluated.\n", "is_correct": false}, {"alternative": " It can be either static or an instance member.\n", "is_correct": false}, {"alternative": " It can be initialized at declaration only.\n", "is_correct": true}, {"alternative": " It can be initialized in either the constructor or the declaration.\n</ul>\n", "is_correct": false}]}, {"question": "Q24. What is the difference between System.String and string?\n", "alternatives": [{"alternative": " string is used for fied-size strings in C#, while System.String is used for all the strings.\n", "is_correct": false}, {"alternative": " There is no such class as System.String.\n", "is_correct": false}, {"alternative": " There is none—string is an alias for System. String.\n", "is_correct": true}, {"alternative": " System.String is a VB.NET data type, while string is a C# type.\n</ul>\n", "is_correct": false}]}, {"question": "Q25. When break is used inside two nested for loops, does control come out of the inner for loop or the outer for loop?\n", "alternatives": [{"alternative": " It breaks from only the outer loop.\n", "is_correct": false}, {"alternative": " It breaks from all loops.\n", "is_correct": false}, {"alternative": " It breaks from only the inner loop.\n", "is_correct": true}, {"alternative": " It breaks from the outer loop after the second iteration.\n</ul>\n", "is_correct": false}]}, {"question": "Q26. You want to separate object construction from its representation. Which design pattern best fits this objective?\n", "alternatives": [{"alternative": " Adapter\n", "is_correct": false}, {"alternative": " Bridge\n", "is_correct": false}, {"alternative": " Singleton\n", "is_correct": false}, {"alternative": " Builder\n</ul>\n", "is_correct": true}]}, {"question": "Q27. You want to encapsulate a command request as an object. Which design pattern best fits this objective?\n", "alternatives": [{"alternative": " Command\n", "is_correct": true}, {"alternative": " Iterator\n", "is_correct": false}, {"alternative": " Facade\n", "is_correct": false}, {"alternative": " Observer\n</ul>\n", "is_correct": false}]}, {"question": "Q28. Why would Pre-JIT be used by the .NET Framework?\n", "alternatives": [{"alternative": " to compile only the methods that are called at runtime and store those methods in cache after execution\n", "is_correct": false}, {"alternative": " to compile complete source code into native code in a single compilation cycle during deployment of the application\n", "is_correct": true}, {"alternative": " to compile only the methods that are called at runtime and then store them in cache for one minute\n", "is_correct": false}, {"alternative": " to compile only the methods that are called at runtime and remove them from memory after execution\n</ul>\n", "is_correct": false}]}, {"question": "Q29. What do code contracts do?\n", "alternatives": [{"alternative": " Code contracts are data structures that can operate on demand per requirements.\n", "is_correct": false}, {"alternative": " Code contracts provide a way to specify preconditions, postconditions, and object invariants in your code.\n", "is_correct": true}, {"alternative": " Code contracts contain definitions for a group of related functionalities that a class or a struct can implement.\n", "is_correct": false}, {"alternative": " Code contracts contain data structures for a group of related functionalities that a class or a struct can implement.\n</ul>\n", "is_correct": false}]}, {"question": "Q30. You must connect an app to an online identity provider using OAuth. For authentication, the app uses WebAuthenticationBroker object. You need to make sure the app registers with the provider. Which action do you take?\n", "alternatives": [{"alternative": " Construct an HTTP request URI and an HTTPS request URI.\n", "is_correct": false}, {"alternative": " Invoke the GetCurrentApplicationCallbackUri method and construct an HTTPS request URI.\n", "is_correct": false}, {"alternative": " Invoke the AuthenticateAsync and GetCurrentApplicationCallbackUri methods.\n", "is_correct": false}, {"alternative": " Invoke the AuthenticateAsync method and construct an HTTPS request URI.\n</ul>\n<blockquote>\n<p>The requestUri parameter must be a HTTPS address and you call the AuthenticateAsync method to connect to the online identity provider and get an access token</p>\n</blockquote>\n", "is_correct": true}]}, {"question": "Q31. You want to create a class of which only a single instance can exist. Which design pattern best fits this objective?\n", "alternatives": [{"alternative": " Adapter\n", "is_correct": false}, {"alternative": " Singleton\n", "is_correct": true}, {"alternative": " Bridge\n", "is_correct": false}, {"alternative": " Decorator\n</ul>\n", "is_correct": false}]}, {"question": "Q32. What is the dependency inversion principle?\n", "alternatives": [{"alternative": " Objects in a program should be replaceable with instances of their subtypes without altering the correctness of that program.\n", "is_correct": false}, {"alternative": " A class should have only a single responsibility—that is, only changes to one part of the software's specification should be able to affect the specification of the class.\n", "is_correct": false}, {"alternative": " Software entities should be open for extension, but closed for modification.\n", "is_correct": false}, {"alternative": " Entities must depend on abstractions, not on concrete implementations.\n</ul>\n", "is_correct": true}]}, {"question": "Q33. What is a namespace?\n", "alternatives": [{"alternative": " a group of generic collections—in a logical hierarchy by function—that enable you to access the core functionality you need in your applications\n", "is_correct": false}, {"alternative": " a group of methods—in a logical hierarchy by class—that enable you to access the core functionality you need in .NET\n", "is_correct": false}, {"alternative": " a group of assemblies—in a logical hierarchy by function—that enable you to access the core functionality you need in your applications\n", "is_correct": false}, {"alternative": " a group of classes, structures, interfaces, enumerations, and delegates—organized in a logical hierarchy by function that enable you to access the core functionality you need in your applications\n</ul>\n", "is_correct": true}]}, {"question": "Q34. Which of the following selects an anonymous type?\n", "alternatives": [{"alternative": " select new { a.Country, a.Region }\n", "is_correct": true}, {"alternative": " select a\n", "is_correct": false}, {"alternative": " select a.Country, a.Region\n", "is_correct": false}, {"alternative": " select { a.Country, a.Region }\n</ul>\n", "is_correct": false}]}, {"question": "Q35. Which is NOT true about a constant variable?\n", "alternatives": [{"alternative": " At compile time, the value is evaluated.\n", "is_correct": false}, {"alternative": " Only at declaration can it be initialized.\n", "is_correct": false}, {"alternative": " At runtime, its value is evaluated.\n", "is_correct": true}, {"alternative": " It cannot be static.\n</ul>\n", "is_correct": false}]}, {"question": "Q36. What is the purpose of CLR?\n", "alternatives": [{"alternative": " CLR performs various operations such as security checks, spell checks, assembly loading, and thread management. It provides a secure execution environment for the internet.\n", "is_correct": false}, {"alternative": " CLR sets the rules developers must use for the components that are interlanguage compatible. CLR is reusable across all the .NET-compliant languages.\n", "is_correct": false}, {"alternative": " CLR is a compiler that converts Intermediate Language to a native code.\n", "is_correct": false}, {"alternative": " CLR performs various operations such as memory management, security checks, assembly loading, and thread management. It also provides a secure execution environment for applications.\n</ul>\n", "is_correct": true}]}, {"question": "Q37. What is CIL?\n", "alternatives": [{"alternative": " Formerly known as MSIL, CIL is a programming language that NET developers use. It represents the lowest possible level for a language that humans can still read.\n", "is_correct": true}, {"alternative": " CIL is an object-oriented programming language that is a partially compiled code that .NET developers will then compile to native machine code.\n", "is_correct": false}, {"alternative": " CIL is used to convert a value type to an object type.\n", "is_correct": false}, {"alternative": " CIL is a compiled code library that Microsoft developed as an open specification. Developers use it for security, versioning, and deployment purposes.\n</ul>\n", "is_correct": false}]}, {"question": "Q38. <strong>_</strong> pattern works as a bridge between two incompatible interfaces? // wording in question is maybe changed?\n", "alternatives": [{"alternative": " Adapter\n", "is_correct": true}, {"alternative": " Bridge\n", "is_correct": false}, {"alternative": " Singleton\n", "is_correct": false}, {"alternative": " Builder\n</ul>\n", "is_correct": false}]}, {"question": "Q39. Why would you use ahead-of-time (AOT) compilation?\n", "alternatives": [{"alternative": " You can deliver a faster startup time, especially in big applications where much code executes on startup.\n", "is_correct": true}, {"alternative": " You have a slow processor.\n", "is_correct": false}, {"alternative": " You have little memory and disk space\n", "is_correct": false}, {"alternative": " The JIT compiler does not have to do a lot of disk I/O actions, which are quite expensive.\n</ul>\n", "is_correct": false}]}, {"question": "Q40. Which statement describes a Dispose method?\n", "alternatives": [{"alternative": " It defines an execution environment for program code and manages the CLR\n", "is_correct": false}, {"alternative": " It belongs to the IDisposable interface and is used to free resources, such as network connection and files.\n", "is_correct": true}, {"alternative": " It is partially method-compiled code library for use in deployment, versioning, and security.\n", "is_correct": false}, {"alternative": " It is used for encapsulation of collections tied to functions of a class and object.\n</ul>\n", "is_correct": false}]}, {"question": "Q41. What is a thread?\n", "alternatives": [{"alternative": " A single operation that does not return a value and that usually executes asynchronously\n", "is_correct": false}, {"alternative": " the basic unit to which an operating system allocate processor time\n", "is_correct": true}, {"alternative": " a series of related tasks or methods that together turn inputs into outputs\n", "is_correct": false}, {"alternative": " a program that is running on your computer\n</ul>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.threading.tasks.task?view=net-5.0\">Reference link</a></p>\n", "is_correct": false}]}, {"question": "Q42. You want to add responsibilities to object dynamically. Which design pattern best fit this objective?\n", "alternatives": [{"alternative": " Decorator\n", "is_correct": true}, {"alternative": " Bridge\n", "is_correct": false}, {"alternative": " Singleton\n", "is_correct": false}, {"alternative": " Facade\n</ul>\n", "is_correct": false}]}, {"question": "Q43. Which choice creates an 8-tuple containing prime numbers that are less than 20?\n", "alternatives": [{"alternative": " <code>var primes = Tuple.Create(2, 3, 5, 7, 11, 13, 17, 19);</code>\n", "is_correct": true}, {"alternative": " <code>var primes = Tuple.Create(2, 3, 5, 7, 11, 13, 17, 21);</code>\n", "is_correct": false}, {"alternative": " <code>var primes = Tuple.Make(2, 3, 5, 7, 11, 13, 17, 20);</code>\n", "is_correct": false}, {"alternative": " <code>var primes = Tuple.Make(2, 3, 5, 7, 11, 13, 17, 19);</code>\n</ul>\n", "is_correct": false}]}, {"question": "Q44. How can you recieve form data without a model binder in a controller action?\n<blockquote>\n<p>Note: The differences are <code>IFormResult</code>/<code>IActionResult</code> and <code>Forms</code>/<code>Form</code></p>\n</blockquote>\n", "alternatives": [{"alternative": "\n</ul>\n<p><code>c#\npublic IFormResult ReceivedDataByRequest()\n{\n      string theName = Request.Forms[\"theName\"];\n      return View();\n}</code></p>\n<ul>\n", "is_correct": false}, {"alternative": "\n</ul>\n<p><code>c#\npublic IActionResult ReceivedDataByRequest()\n{\n      string theName = Request.Forms[\"theName\"];\n      return View();\n}</code></p>\n<ul>\n", "is_correct": false}, {"alternative": "\n</ul>\n<p><code>c#\npublic IFormResult ReceivedDataByRequest()\n{\n      string theName = Request.Form[\"theName\"];\n      return View();\n}</code></p>\n<ul>\n", "is_correct": false}, {"alternative": "\n</ul>\n<p><code>c#\npublic IActionResult ReceivedDataByRequest()\n{\n      string theName = Request.Form[\"theName\"];\n      return View();\n}</code></p>\n", "is_correct": true}]}, {"question": "Q45. Where should you store connection string information?\n", "alternatives": [{"alternative": " in any file within the namespace of the program\n", "is_correct": false}, {"alternative": " in the view\n", "is_correct": false}, {"alternative": " in configuration files\n", "is_correct": true}, {"alternative": " in the database\n</ul>\n", "is_correct": false}]}, {"question": "Q46. Why use design patterns?\n", "alternatives": [{"alternative": " design patterns make the code more efficient with memory usage\n", "is_correct": false}, {"alternative": " design patterns minimize the number of code lines when creating complex applications\n", "is_correct": false}, {"alternative": " design patterns tend to be more secure and prevent code from being hacked\n", "is_correct": false}, {"alternative": " design patterns help you solve issues related to sofware development using a proven solution, and make communication between developers more efficient\n</ul>\n", "is_correct": true}]}, {"question": "Q47. What is a task?\n", "alternatives": [{"alternative": " the basic unit to which an operating system allocates processor time\n", "is_correct": false}, {"alternative": " a program that is running on your compiler\n", "is_correct": false}, {"alternative": " a single operation that does not return a value and that usually executes asynchronously\n", "is_correct": true}, {"alternative": " a series of related methods that together turn inputs into outputs\n</ul>\n", "is_correct": false}]}, {"question": "Q48. Which choice is NOT a component of .NET Framework?\n", "alternatives": [{"alternative": " common language JIT\n", "is_correct": false}, {"alternative": " .NET framework class library\n", "is_correct": true}, {"alternative": " common language runtime\n", "is_correct": false}, {"alternative": " side-by-side execution\n</ul>\n", "is_correct": false}]}, {"question": "Q49. Which statement about the <code>this</code> keyword is <em>not</em> true?\n", "alternatives": [{"alternative": " The <code>this</code> keyword lets a constructor call a different constructor in the same class.\n", "is_correct": false}, {"alternative": " A constructor can use a base statement and a <code>this</code> statement if the base statement comes first.\n", "is_correct": true}, {"alternative": " A constructor can use one <code>this</code> statement at most.\n", "is_correct": false}, {"alternative": " If a constructor uses a <code>this</code> statement, its code is executed after the invoked constructor is executed.\n</ul>\n", "is_correct": false}]}, {"question": "Q50. When should you use the .NET Core class library project type?\n", "alternatives": [{"alternative": " when you want to increase the .NET API surface area your library can access, and allow only .NET Core apps to be compatible with your library\n", "is_correct": true}, {"alternative": " when you want to increase the number of apps that are compatible with your library, and decrease the .NET API surface area your library can access\n", "is_correct": false}, {"alternative": " when you want to decrease speed but have more features\n", "is_correct": false}, {"alternative": " when you want to increase compilation speed and have fewer features\n</ul>\n", "is_correct": false}]}, {"question": "Q51. Why would the .NET Framework use Normal-JIT (Just-in-Time)?\n", "alternatives": [{"alternative": " to compile complete source code into native code in a single compilation cycle during deployment of the application\n", "is_correct": false}, {"alternative": " to compile only the methods that are called at runtime and remove them from memory after execution\n", "is_correct": false}, {"alternative": " to compile only the methods that are called at runtime and them store them in cache for one minute\n", "is_correct": false}, {"alternative": " to compile only methods called at runtime – which are compiled the first time the methods are called and then stored in a cache to be used for execution when the same methods are called again\n</ul>\n<p><a href=\"https://www.c-sharpcorner.com/UploadFile/nipuntomar/jit-just-in-time-compiler/\">JIT (Just-In-Time) Compiler</a></p>\n", "is_correct": true}]}, {"question": "Q52. What is .NET?\n", "alternatives": [{"alternative": " .NET is a general-purpose programming language. The language has expanded significantly over time, and now has object-oriented, generic, and functional features in addition to facilities for low-level memory manipulation.\n", "is_correct": false}, {"alternative": " .NET is a virtual machine that enables a computer to run programs written in several languages and compile programs to bytecode.\n", "is_correct": false}, {"alternative": " .NET is an interpreted, high-level, general-purpose programming language. Its language constructs an object-oriented approach aimed at helping programmers write clear, logical code for small and large-scale projects.\n", "is_correct": false}, {"alternative": " .NET is a free, cross-platform, open-source developer platform for building many different types of applications with multiple languages, editors, and libraries for web, mobile, desktop, gaming, and IoT.\n</ul>\n<p><a href=\"https://dotnet.microsoft.com/learn/dotnet/what-is-dotnet\">What is .NET?</a></p>\n", "is_correct": true}]}, {"question": "Q53. The ASP.NET Core Module is a native IIS module that plugs into the IIS pipeline to either <strong>_</strong>.\n", "alternatives": [{"alternative": " host an ASP.NET Code app inside of the IIS worker process, called the out-of-process hosting model, or forward web requests to a backend ASP.NET Core app running the Kesrel server, called the in-process hosting model\n", "is_correct": false}, {"alternative": " create IIS code the server needs in a file with the extension required, or run the IIS server in a mode compatible for ASP.NET Core\n", "is_correct": false}, {"alternative": " package up your C# application and C# packages into .NET modules, or specify which of its packages should be visible to other .NET modules\n", "is_correct": false}, {"alternative": " host an ASP.NET Code app inside of the IIS workes process, called the in-process hosting model, or forward web requests to a backend ASP.NET Core app running the Kestrel server, called the out-of-process hosting model\n</ul>\n<p><a href=\"https://docs.microsoft.com/en-us/aspnet/core/host-and-deploy/aspnet-core-module?view=aspnetcore-5.0\">ASP.NET Core Module</a></p>\n", "is_correct": true}]}, {"question": "Q54. In the code below, what is the difference between RenderPartial and RenderAction?\n<p><code>cs\n@{\n  Html.RenderAction(\"Add\");\n  Html.RenderPartial(\"Add\");\n}</code></p>\n", "alternatives": [{"alternative": " RenderPartial will call an action method of the current controller and render a result inline. RenderAction will render the specified view inline without calling any action method.\n", "is_correct": false}, {"alternative": " RenderAction will call an action method of the current model and render a result inline. RenderPartial will render the specified view inline without calling any action method.\n", "is_correct": false}, {"alternative": " RenderAction will call an action method of the current controller and render a result inline. RenderPartial will render the specified view inline without calling any action method.\n", "is_correct": true}, {"alternative": " RenderPartial will call an action method of the current model and render a result inline. RenderAction will render the specified view inline without calling any action method.\n</ul>\n", "is_correct": false}]}, {"question": "Q55. What is the Liskov substitution principle?\n", "alternatives": [{"alternative": " Many client-specific interfaces are better than one general-purpose interface.\n", "is_correct": false}, {"alternative": " Objects in a program should be replaceable with instances of their subtypes without altering the correctness of that program.\n", "is_correct": true}, {"alternative": " A class should have only a single responsibility — that is, only changes to one part of the software's specification should be able to affect the specification of the class.\n", "is_correct": false}, {"alternative": " Software entities should be open for extension, but closed for modification.\n</ul>\n<p><a href=\"https://en.wikipedia.org/wiki/Liskov_substitution_principle\">Liskov substitution principle</a></p>\n", "is_correct": false}]}, {"question": "Q56. What method do you use to explicitly kill a user's session?\n", "alternatives": [{"alternative": " <code>Session.Timeout()</code>\n", "is_correct": false}, {"alternative": " <code>Session.Abandon()</code>\n", "is_correct": true}, {"alternative": " <code>Session.KillAll()</code>\n", "is_correct": false}, {"alternative": " <code>Session.Remove()</code>\n</ul>\n<p><a href=\"https://docs.microsoft.com/en-us/previous-versions/iis/6.0-sdk/ms524310(v=vs.90)\">Session.Abandon Method</a></p>\n", "is_correct": false}]}, {"question": "Q57. Which choice best describes the difference between globalization and localization?\n", "alternatives": [{"alternative": " Localization enables the .NET runtime to provide services to managed code so language compilers can emit metadata and references in your code. Globalization reverses this process.\n", "is_correct": false}, {"alternative": " Globalization enables the .NET runtime to provide services to managed code so language compilers can emit metadata and references in your code. Localization reverses this process.\n", "is_correct": false}, {"alternative": " Localization involves designing and developing a world-ready app that supports localized interfaces and regional data for users in multiple cultures. Globalization is the process of translating an application's resources into versions for each culture that the application will support.\n", "is_correct": false}, {"alternative": " Globalization involves designing and developing a world-ready app that supports localized interfaces and regional data for users in multiple cultures. Localization is the process of translating an application's resources into versions for each culture that the application will support.\n</ul>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/core/extensions/globalization-and-localization\">Globalize and localize .NET applications</a></p>\n", "is_correct": true}]}, {"question": "Q58. What does CIL stand for?\n", "alternatives": [{"alternative": " C# Interpreted Language\n", "is_correct": false}, {"alternative": " Common Intermediate Language\n", "is_correct": true}, {"alternative": " Commonly Interpreted Language\n", "is_correct": false}, {"alternative": " C# Intermediate Language\n</ul>\n<p><a href=\"https://ythi.net/abbreviations/english/what-does-cil-mean-what-is-the-full-form-of-cil/\">What is the full form of CIL?</a></p>\n", "is_correct": false}]}, {"question": "Q59. Which choice best describes the difference between a namespace and an assembly?\n", "alternatives": [{"alternative": " Namespace contains code to form MSIL (Microsoft Intermediate Language). An assembly contains a set of unique names.\n", "is_correct": false}, {"alternative": " Namespace is the logical naming decided at design time by the developer. Scope for a particular type is defined at run time using an assembly.\n", "is_correct": true}, {"alternative": " A namespace has logical units that are physically grouped together. An assembly does not have any classification.\n", "is_correct": false}, {"alternative": " A namespace has logical units that are physically grouped together for assemblies. Assembly classes are available in your program and will be logically grouped.\n</ul>\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/standard/assembly/\">Source</a></p>\n", "is_correct": false}]}, {"question": "Q60. What is a tuple?\n", "alternatives": [{"alternative": " A data structure that has a specific number and sequence of elements\n", "is_correct": true}, {"alternative": " An object to store multiple variables of the same type in an array data structure\n", "is_correct": false}, {"alternative": " A group of classes designed specifically for grouping together objects and performing tasks on them\n", "is_correct": false}, {"alternative": " An array whose elements are jagged\n</ul>\n", "is_correct": false}]}, {"question": "Q61. What does IL stand for?\n", "alternatives": [{"alternative": " Intermediate Language\n", "is_correct": true}, {"alternative": " Intelligent Language\n", "is_correct": false}, {"alternative": " Intelligent Linq\n", "is_correct": false}, {"alternative": " Interpreted Language\n</ul>\n", "is_correct": false}]}, {"question": "Q62. You want to create an instance of several families of classes. Which design pattern best fits this objective?\n", "alternatives": [{"alternative": " Decorator\n", "is_correct": false}, {"alternative": " Singleton\n", "is_correct": false}, {"alternative": " Abstract Factory\n", "is_correct": true}, {"alternative": " Bridge\n</ul>\n", "is_correct": false}]}, {"question": "Q63. Which statement about a read-only variable is <em>not</em> true?\n", "alternatives": [{"alternative": " It can be either static or an instance memeber.\n", "is_correct": false}, {"alternative": " At run time, its value is evaluated.\n", "is_correct": false}, {"alternative": " It can be initialized in either the constructor or the declaration.\n", "is_correct": false}, {"alternative": " It can be initialized at declaration only.\n</ul>\n", "is_correct": true}]}, {"question": "Q64. What is the interface segregation principle?\n", "alternatives": [{"alternative": " Many client-specific interfaces are better than one general-purpose interface.\n", "is_correct": true}, {"alternative": " Software entities should be open for extension, but closed for modification.\n", "is_correct": false}, {"alternative": " A class should have only a single responsibility - that is, only changes to one part of the software's specification should be able to affect the specification of the class.\n", "is_correct": false}, {"alternative": " Objects in a program should be replaceable with instances of their subtypes without altering the correctness of that program.\n</ul>\n", "is_correct": false}]}, {"question": "Q65. Why would the .NET Framework use Econo-JIT (Just-inTime)?\n", "alternatives": [{"alternative": " to compile only the methods that are called at run time and then store them in cache for one minute\n", "is_correct": false}, {"alternative": " to compile only methods called at run time - which are compiled the first time the methods are called and then stored in cache to be used for execution when the same methods are called again\n", "is_correct": false}, {"alternative": " to compile complete source code into native code in a single compilation cycle during deployment of the application\n", "is_correct": false}, {"alternative": " to compile only the methods that are called at run time and remove them from memory after execution\n</ul>\n", "is_correct": true}]}, {"question": "Q66. What is the difference between a heap and a stack?\n", "alternatives": [{"alternative": " The stack contains stored value types; the heap contains stored reference types.\n", "is_correct": true}, {"alternative": " The heap is stored value types; the stack is stored reference types.\n", "is_correct": false}, {"alternative": " The heap is stored object types; the stack is stored class types.\n", "is_correct": false}, {"alternative": " The stack is stored object types; the heap is stored class types.\n</ul>\n", "is_correct": false}]}, {"question": "Q67. What is open closed principle?\n", "alternatives": [{"alternative": " software entities should be open for extension, but closed for modification.\n</ul>\n", "is_correct": true}]}, {"question": "Q68. How do you make sure that the garbage collector is done running when you call <code>GC.Collect()</code>?\n", "alternatives": [{"alternative": " There is no way to find this out.\n", "is_correct": false}, {"alternative": " You cannot. <a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.gc.collect\"><code>GC.Collect()</code></a> is a blocking method, and will return only once the garbage collector is done running.\n", "is_correct": false}, {"alternative": " by calling <a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.gc.waitforfullgccomplete\"><code>GC.WaitForFullGCComplete()</code></a>\n", "is_correct": true}, {"alternative": " by calling <a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.gc.waitforpendingfinalizers\"><code>GC.WaitForPendingFinalizers()</code></a>\n</ul>\n", "is_correct": false}]}, {"question": "Q69. What does JIT do in .Net?\n", "alternatives": [{"alternative": " JIT is used for deployment, versioning, and security.\n", "is_correct": false}, {"alternative": " JIT translates the IL code to an assembly code and uses the CPU architecture of the target machine to execute a .NET application.\n", "is_correct": true}, {"alternative": " JIT compiles to C# code using .NET environment properties.\n", "is_correct": false}, {"alternative": " JIT is used for deployment, versioning, and security, and forces the computer's processor to execute the native machine code.\n</ul>\n<p>Reference: <a href=\"https://docs.microsoft.com/en-us/dotnet/standard/managed-execution-process#compilation-by-the-jit-compiler\">Compilation by the JIT compiler</a></p>\n", "is_correct": false}]}, {"question": "Q70. Which statement about a constant variable is not <code>true</code>?\n", "alternatives": [{"alternative": " At run time, its value is evaluated.\n", "is_correct": true}, {"alternative": " It cannot be static.\n", "is_correct": false}, {"alternative": " Only at declaration can it be initialized.\n", "is_correct": false}, {"alternative": " At compile time, the value is evaluated.\n</ul>\n", "is_correct": false}]}, {"question": "Q71. What is the difference between managed and unmanaged code?\n", "alternatives": [{"alternative": " Managed code is code that is handled by the common language runtime (CLR). Unmanaged code is any code that does not depend on CLR for execution.\n", "is_correct": true}, {"alternative": " Managed code is any code that does not depend on the common language runtime (CLR) for execution. Unmanaged code is code that is handled by the CLR.\n", "is_correct": false}, {"alternative": " Managed code is code that is handled by Microsoft Intermediate Language (MSIL). Unmanaged code is any code that does not depend on MSIL for execution.\n", "is_correct": false}, {"alternative": " Managed code is any code that does not depend on Microsoft Intermediate Language (MSIL) for execution. Unmanaged code is code that is handled by MSIL.\n</ul>\n", "is_correct": false}]}, {"question": "Q72. Why use the Configure method of startup class?\n", "alternatives": [{"alternative": " It can be used to configure the application services.\n", "is_correct": false}, {"alternative": " It can ensure that middleware runs before or after middleware added by libraries at the start or end of the app's request processing pipeline.\n", "is_correct": true}, {"alternative": " It can specify how the app respondes to HTTP requests.\n", "is_correct": false}, {"alternative": " It can specify how the app makes requests to HTTP.\n</ul>\n", "is_correct": false}]}, {"question": "Q73. You want to match interfaces of different classes. which design pattern best fits this objective?\n", "alternatives": [{"alternative": " Decorator\n", "is_correct": false}, {"alternative": " Bridge\n", "is_correct": false}, {"alternative": " Singleton\n", "is_correct": false}, {"alternative": " Adapter\n</ul>\n", "is_correct": true}]}, {"question": "Q75. What is the difference between covariance and contravariance?\n", "alternatives": [{"alternative": " In C#, covariance and contravariance disable implicit reference conversion for array types, delegate types, and generic type arguments. Contravariance preserves assignment compatibility and covariance reverses it.\n", "is_correct": false}, {"alternative": "[X] In C#, covariance and contravariance enable implicit reference conversion for array types, delegate types, and generic type arguments. Covariance preserves assignment compatibility and contravariance reverses it.\n", "is_correct": false}, {"alternative": " In C#, covariance and contravariance enable implicit reference conversion for array types, delegate types, and generic type arguments. Contravariance preserves assignment compatibility and covariance reverses itIn C#, covariance and contravariance disable implicit reference conversion for array types, delegate types, and generic type arguments. Contravariance preserves assignment compatibility and covariance reverses it.\n", "is_correct": false}, {"alternative": " In C#, covariance and contravariance disables implicit reference conversion for array types, delegate types, and generic type arguments. Covariance preserves assignment compatibility and contravariance reverses it.\n</ul>\n<p>Reference: <a href=\"https://learn.microsoft.com/en-us/dotnet/csharp/programming-guide/concepts/covariance-contravariance/\">Covariance and Contravariance</a></p>", "is_correct": false}]}]}